Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CZ-CA91_DFP/1.0.11/atdf/PIC32CZ2051CA91144.atdf
          <instance name="TCC6">
            <register-group name="TCC6" name-in-module="TCC" address-space="base" offset="0x46012000"/>
            <signals>
              <signal group="WO" index="0" function="F" pad="PC10" ioset="1"/>
              <signal group="WO" index="0" function="F" pad="PC21" ioset="2"/>
              <signal group="WO" index="1" function="F" pad="PC11" ioset="1"/>
              <signal group="WO" index="1" function="F" pad="PC22" ioset="2"/>
            </signals>
            <parameters>
              <param name="CC_NUM" value="2" caption="Number of Compare/Capture units"/>
              <param name="DITHERING" value="1" caption="Dithering feature implemented"/>
              <param name="DMAC_ID_MC_0" value="60" caption="Indexes of DMA Match/Compare triggers 0"/>
              <param name="DMAC_ID_MC_1" value="61" caption="Indexes of DMA Match/Compare triggers 1"/>
              <param name="DMAC_ID_OVF" value="59" caption="DMA overflow/underflow/retrigger trigger"/>
              <param name="DTI" value="1" caption="Dead-Time-Insertion feature implemented"/>
              <param name="GCLK_ID" value="37" caption="Index of Generic Clock"/>
              <param name="MASTER_SLAVE_MODE" value="0" caption="TCC type 0 : NA, 1 : Master, 2 : Slave"/>
              <param name="OTMX" value="0" caption="Output Matrix feature implemented"/>
              <param name="OW_NUM" value="2" caption="Number of Output Waveforms"/>
              <param name="PG" value="0" caption="Pattern Generation feature implemented"/>
              <param name="SIZE" value="32"/>
              <param name="SWAP" value="1" caption="DTI outputs swap feature implemented"/>
              <param name="INSTANCE_ID" value="39" caption="Instance index for TCC6"/>
              <param name="MCLK_ID_APB" value="47" caption="Index for TCC6 APB clock"/>
              <param name="PAC_ID" value="39" caption="Index for TCC6 registers write protection"/>
            </parameters>
          </instance>
          <instance name="TCC7">
            <register-group name="TCC7" name-in-module="TCC" address-space="base" offset="0x46810000"/>
            <signals>
              <signal group="WO" index="0" function="F" pad="PA22" ioset="1"/>
              <signal group="WO" index="0" function="F" pad="PD08" ioset="2"/>
              <signal group="WO" index="1" function="F" pad="PA23" ioset="1"/>
              <signal group="WO" index="1" function="F" pad="PD07" ioset="2"/>
            </signals>
            <parameters>
              <param name="CC_NUM" value="2" caption="Number of Compare/Capture units"/>
              <param name="DITHERING" value="1" caption="Dithering feature implemented"/>
              <param name="DMAC_ID_MC_0" value="63" caption="Indexes of DMA Match/Compare triggers 0"/>
              <param name="DMAC_ID_MC_1" value="64" caption="Indexes of DMA Match/Compare triggers 1"/>
              <param name="DMAC_ID_OVF" value="62" caption="DMA overflow/underflow/retrigger trigger"/>
              <param name="DTI" value="1" caption="Dead-Time-Insertion feature implemented"/>
              <param name="GCLK_ID" value="38" caption="Index of Generic Clock"/>
              <param name="MASTER_SLAVE_MODE" value="0" caption="TCC type 0 : NA, 1 : Master, 2 : Slave"/>
              <param name="OTMX" value="0" caption="Output Matrix feature implemented"/>
              <param name="OW_NUM" value="2" caption="Number of Output Waveforms"/>
              <param name="PG" value="0" caption="Pattern Generation feature implemented"/>
              <param name="SIZE" value="32"/>
              <param name="SWAP" value="1" caption="DTI outputs swap feature implemented"/>
              <param name="INSTANCE_ID" value="40" caption="Instance index for TCC7"/>
              <param name="MCLK_ID_APB" value="48" caption="Index for TCC7 APB clock"/>
              <param name="PAC_ID" value="40" caption="Index for TCC7 registers write protection"/>
            </parameters>
          </instance>
          <instance name="TCC8">
            <register-group name="TCC8" name-in-module="TCC" address-space="base" offset="0x46812000"/>
            <signals>
              <signal group="WO" index="0" function="F" pad="PA21" ioset="1"/>
              <signal group="WO" index="0" function="F" pad="PC14" ioset="2"/>
              <signal group="WO" index="1" function="F" pad="PC15" ioset="1"/>
            </signals>
            <parameters>
              <param name="CC_NUM" value="2" caption="Number of Compare/Capture units"/>
              <param name="DITHERING" value="1" caption="Dithering feature implemented"/>
              <param name="DMAC_ID_MC_0" value="66" caption="Indexes of DMA Match/Compare triggers 0"/>
              <param name="DMAC_ID_MC_1" value="67" caption="Indexes of DMA Match/Compare triggers 1"/>
              <param name="DMAC_ID_OVF" value="65" caption="DMA overflow/underflow/retrigger trigger"/>
              <param name="DTI" value="1" caption="Dead-Time-Insertion feature implemented"/>
              <param name="GCLK_ID" value="39" caption="Index of Generic Clock"/>
              <param name="MASTER_SLAVE_MODE" value="0" caption="TCC type 0 : NA, 1 : Master, 2 : Slave"/>
              <param name="OTMX" value="0" caption="Output Matrix feature implemented"/>
              <param name="OW_NUM" value="2" caption="Number of Output Waveforms"/>
              <param name="PG" value="0" caption="Pattern Generation feature implemented"/>
              <param name="SIZE" value="32"/>
              <param name="SWAP" value="1" caption="DTI outputs swap feature implemented"/>
              <param name="INSTANCE_ID" value="41" caption="Instance index for TCC8"/>
              <param name="MCLK_ID_APB" value="49" caption="Index for TCC8 APB clock"/>
              <param name="PAC_ID" value="41" caption="Index for TCC8 registers write protection"/>
            </parameters>
          </instance>
          <instance name="TCC9">
            <register-group name="TCC9" name-in-module="TCC" address-space="base" offset="0x46814000"/>
            <signals>
              <signal group="WO" index="0" function="F" pad="PD04" ioset="1"/>
              <signal group="WO" index="1" function="F" pad="PD05" ioset="1"/>
              <signal group="WO" index="2" function="F" pad="PD06" ioset="1"/>
              <signal group="WO" index="3" function="F" pad="PD03" ioset="1"/>
              <signal group="WO" index="4" function="F" pad="PD02" ioset="1"/>
              <signal group="WO" index="5" function="F" pad="PC20" ioset="1"/>
            </signals>
            <parameters>
              <param name="CC_NUM" value="6" caption="Number of Compare/Capture units"/>
              <param name="DITHERING" value="1" caption="Dithering feature implemented"/>
              <param name="DMAC_ID_MC_0" value="69" caption="Indexes of DMA Match/Compare triggers 0"/>
              <param name="DMAC_ID_MC_1" value="70" caption="Indexes of DMA Match/Compare triggers 1"/>
              <param name="DMAC_ID_MC_2" value="71" caption="Indexes of DMA Match/Compare triggers 2"/>
              <param name="DMAC_ID_MC_3" value="72" caption="Indexes of DMA Match/Compare triggers 3"/>
              <param name="DMAC_ID_MC_4" value="73" caption="Indexes of DMA Match/Compare triggers 4"/>
              <param name="DMAC_ID_MC_5" value="74" caption="Indexes of DMA Match/Compare triggers 5"/>
              <param name="DMAC_ID_OVF" value="68" caption="DMA overflow/underflow/retrigger trigger"/>
              <param name="DTI" value="1" caption="Dead-Time-Insertion feature implemented"/>
              <param name="GCLK_ID" value="40" caption="Index of Generic Clock"/>
              <param name="MASTER_SLAVE_MODE" value="0" caption="TCC type 0 : NA, 1 : Master, 2 : Slave"/>
              <param name="OTMX" value="1" caption="Output Matrix feature implemented"/>
              <param name="OW_NUM" value="6" caption="Number of Output Waveforms"/>
              <param name="PG" value="1" caption="Pattern Generation feature implemented"/>
              <param name="SIZE" value="32"/>
              <param name="SWAP" value="1" caption="DTI outputs swap feature implemented"/>
              <param name="INSTANCE_ID" value="42" caption="Instance index for TCC9"/>
              <param name="MCLK_ID_APB" value="50" caption="Index for TCC9 APB clock"/>
              <param name="PAC_ID" value="42" caption="Index for TCC9 registers write protection"/>
            </parameters>
          </instance>
        </module>
