Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CZ-CA91_DFP/1.0.11/atdf/PIC32CZ2051CA91144.atdf
        <register name="VREGCTRL" offset="0x1C" rw="RW" size="4" initval="0x00000000" caption="VREG Control">
          <bitfield name="VREGOUT" caption="VREG Output Control in RUN mode only. Enable by production fuse by CALSUPC.VREGOUTEN" mask="0x3" values="VREGCTRL__VREGOUT"/>
          <bitfield name="OFFSTDBY" caption="Off in Standby Control for VREGSW[N-1]. Useful for Riverside only." mask="0x4" values="VREGCTRL__OFFSTDBY"/>
          <bitfield name="SRAM_VLD" caption="SRAM Valid Status Bit" mask="0x10" values="VREGCTRL__SRAM_VLD"/>
          <bitfield name="BKUP_VLD" caption="Backup Valid Status Bit" mask="0x20" values="VREGCTRL__BKUP_VLD"/>
          <bitfield name="CPEN" caption="Charge Pump Enable and Auto-enable." mask="0x700"/>
          <bitfield name="AVREGEN" caption="Additional Voltage Regulator Enable" mask="0x70000" values="RPMU_VREGCTRL__AVREGEN"/>
          <bitfield name="AVREGSTDBY" caption="Additional Voltage Regulator Configuration" mask="0x7000000" values="VREGCTRL__AVREGSTDBY"/>
        </register>
        <register name="VREFCTRL" offset="0x20" rw="RW" size="4" initval="0x00000003" caption="VREF Control">
          <bitfield name="LPSTDBY" caption="Bandgap and Regulators Low Power Standby Enable" mask="0x1" values="VREFCTRL__LPSTDBY"/>
          <bitfield name="LPHIB" caption="Bandgap and Regulators Low Power Hibernate Enable" mask="0x2" values="VREFCTRL__LPHIB"/>
          <bitfield name="TSEN" caption="Temperature Sensor Output Enable" mask="0x10"/>
        </register>
        <register name="BKOUT" offset="0x28" rw="RW" size="4" initval="0x00000000" caption="Backup Output Control">
          <bitfield name="EN0" caption="Enable Output" mask="0x1"/>
          <bitfield name="EN1" caption="Enable Output" mask="0x4"/>
          <bitfield name="CLR0" caption="Clear Output" mask="0x100"/>
          <bitfield name="CLR1" caption="Clear Output" mask="0x400"/>
          <bitfield name="SET0" caption="Set Output" mask="0x10000"/>
          <bitfield name="SET1" caption="Set Output" mask="0x40000"/>
          <bitfield name="TGLOM0" caption="Toggle Output Mode" mask="0x3000000" values="BKOUT__TGLOM"/>
          <bitfield name="TGLOM1" caption="Toggle Output Mode" mask="0xC000000" values="BKOUT__TGLOM"/>
        </register>
        <register name="BKIN" offset="0x2C" rw="R" size="4" initval="0x00000000" caption="Backup Input Control">
          <bitfield name="BKIN" caption="Backup Input Value" mask="0x3"/>
        </register>
      </register-group>
      <value-group name="BOR__DCBORPSEL">
        <value name="NODIV" caption="Not Divided" value="0x0"/>
        <value name="DIV2" caption="Divide clock by 2" value="0x1"/>
        <value name="DIV4" caption="Divide clock by 4" value="0x2"/>
        <value name="DIV8" caption="Divide clock by 8" value="0x3"/>
        <value name="DIV16" caption="Divide clock by 16" value="0x4"/>
        <value name="DIV32" caption="Divide clock by 32" value="0x5"/>
        <value name="DIV64" caption="Divide clock by 64" value="0x6"/>
        <value name="DIV128" caption="Divide clock by 128" value="0x7"/>
      </value-group>
      <value-group name="BOR__BORFILT">
        <value name="NOFILT" caption="No digital filtering" value="0x0"/>
        <value name="FILT32US" caption="32us filtering" value="0x1"/>
        <value name="FILT125US" caption="125us filtering" value="0x2"/>
        <value name="FILT250US" caption="250us filtering" value="0x3"/>
      </value-group>
      <value-group name="LVD__DIR">
        <value name="rising" caption="Rising detection" value="0x0"/>
        <value name="falling" caption="Falling detection" value="0x1"/>
      </value-group>
      <value-group name="VREGCTRL__VREGOUT">
        <value name="1p2v" caption="In Active mode, VDDCORE_RAM, VDDCORE_BU, VDDCORE_SW and optionnaly VDDCORE_PLL USB are set to 1.2v." value="0x0"/>
        <value name="1p0v" caption="In Active mode, VDDCORE_RAM, VDDCORE_BU, VDDCORE_SW and optionnaly VDDCORE_PLL USB are set to 1.0v." value="0x1"/>
        <value name="0p8v" caption="In Active mode, VDDCORE_RAM, VDDCORE_BU, VDDCORE_SW and optionnaly VDDCORE_PLL USB are set to 0.8v." value="0x2"/>
      </value-group>
      <value-group name="VREGCTRL__OFFSTDBY">
        <value name="OFF" caption="In standby mode, VREGSW1,2,3 are OFF" value="0x0"/>
        <value name="ON" caption="In standby mode, VREGSW1,2,3 are ON" value="0x1"/>
      </value-group>
      <value-group name="VREGCTRL__LVSTDBY">
        <value name="1p2v" caption="In standby mode, VDDCORE_BU, VDDCORE_RAM, VDDCORE_SW and optionnaly VDDCOREUSB/PLL are set to 1.2v." value="0x0"/>
        <value name="0p8v" caption="In standby mode, VDDCORE_BU, VDDCORE_RAM, VDDCORE_SW and optionnaly VDDCOREUSB/PLL are set to 0.8v." value="0x1"/>
      </value-group>
      <value-group name="VREGCTRL__LVHIB">
        <value name="1p2v" caption="In Hibernate mode, VDDCORE_BU and VDDCORE_RAM are set to 1.2v." value="0x0"/>
        <value name="0p8v" caption="In Hibernate mode, VDDCORE_BU and VDDCORE_RAM are set to 0.8v" value="0x1"/>
      </value-group>
      <value-group name="VREGCTRL__AVREGSTDBY">
        <value name="OFFINSTDBY" caption="Regulator is OFF while in sleep mode equal or deeper than standby mode. It is OFF in hibernate and backup mode as well." value="0x0"/>
        <value name="ONINSTDBY" caption="Regulator is ON in Standby mode if AVREGEN bit is set. is OFF from Hibernate mode. It is OFF in backup mode as well." value="0x1"/>
      </value-group>
      <value-group name="VREFCTRL__LPSTDBY">
        <value name="FullPower" caption="In standby mode, bandgap and enabled regulator(s) are set to nominal power mode." value="0x0"/>
        <value name="LowPower" caption="In standby mode, bandgap and enabled regulator(s) are set to low power mode." value="0x1"/>
      </value-group>
      <value-group name="VREFCTRL__LPHIB">
        <value name="FullPower" caption="In hibernate mode, bandgap is set to nominal power mode. As a consequence, enabled regulator(s) are set to nominal power mode." value="0x0"/>
        <value name="LowPower" caption="In hibernate mode, bandgap is set to low power mode. As a consequence, enabled regulator(s) are set to low power mode." value="0x1"/>
      </value-group>
      <value-group name="BKOUT__TGLOM">
        <value name="DISABLE" caption="The output does not toggle." value="0x0"/>
        <value name="RTCTGL" caption="The output toggles on RTC event." value="0x1"/>
        <value name="BKUPTGL" caption="The output is set when the device enters backup mode or battery backup mode. The output should then be cleared by software." value="0x2"/>
      </value-group>
    </module>
    <module name="SysTick" id="SYSTEM_IP" version="1.0.0" caption="System timer">
      <register-group name="SysTick" caption="System timer">
        <register name="CSR" offset="0x0" rw="RW" size="4" access-size="4" initval="0x4" caption="SysTick Control and Status Register">
          <bitfield name="ENABLE" caption="SysTick Counter Enable" mask="0x1" values="CSR__ENABLE"/>
          <bitfield name="TICKINT" caption="SysTick Exception Request Enable" mask="0x2" values="CSR__TICKINT"/>
          <bitfield name="CLKSOURCE" caption="Clock Source 0=external, 1=processor" mask="0x4" values="CSR__CLKSOURCE"/>
          <bitfield name="COUNTFLAG" caption="Timer counted to 0 since last read of register" mask="0x10000"/>
        </register>
